label durak_ruls:

    r "Итак, у нас есть колода карт из 36 штук. Каждый из нас получит по 6 карт. Остаток колоды кладется рубашкой вверх – это будет наша колода для добора"
    
    r "Верхняя карта колоды переворачивается и кладется под калоду рубашкой вниз – это будет козырь. Масть этой карты определяет, какая масть будет главной в этой партии."

    r "Цель игры – избавиться от всех своих карт. Кто останется с картами на руках в конце игры – тот и дурак! Логично, да?"

    show rui nc happy at sd

    r "Ход игры начинается с того, у кого на руках самый маленький козырь."

    r "Достоинства карты определаются следующим образом (от мньшего к большему): от 6 до 10, валет, дама, кароль, туз."

    r "Например, у тебя меньший козырь это шестёрка, а у меня или выше, или козыря нет вообще, тогда ты ходишь."
    
    r "Ходить можно одной или несколькими картами одинакового достоинства. Например, если у тебя есть два валета, ты можешь выложить их оба."

    show rui nc hello at sd
    
    r 'Следующий игрок должен "отбиться". Это значит, что он должен положить карты старшего достоинства той же масти, или козыря, если бьет карту не козырной масти.'
    
    r "А козыры бьются только козырами старшего достоинства. Отбитые карты кладутся в отдельную кучу рубашкой вверх."
    
    r "Если он не может или не хочет отбиваться, он берет все карты со стола себе."

    r "После того, как атака отбита или принята, все игроки добирают карты из колоды до шести. Если колода закончилась, то игроки просто продолжают играть с тем, что у них есть на руках."

    show rui nc crazy1 at sd
    
    r "А теперь самое интересное: Перевод и подкидывание!"

    show rui nc hello at sd
    
    r 'Если у тебя есть карта того же достоинства, что и карта, которой на тебя пошли, ты можешь "перевести" ход, положив эту карту рядом. Тогда уже мне придется отбиваться.'

    r "И подкидывание! После того, как я побьюсь, ты можешь подкинуть карты того достоинства, которое уже есть на столе."

    r "Игра продолжается до тех пор, пока у одного игрока не закончатся карты. Он считается победителем, а другой проигравшим, то есть дураком."
    
    r "В процессе игры все станет намного понятнее!"

    return